biergarten-api/app/controllers/api/v1/beers_controller.rb

    def index
      beers = Beer.all
---
SELECT "beers".* FROM "beers"

    def update
      beer = Beer.find(params[:id])
      beer.update(beer_params)
---
SELECT "beers".* FROM "beers" WHERE "beers"."id" = $1 LIMIT $2  [["id", 40], ["LIMIT", 1]]
UPDATE "beers" SET "likes" = $1, "updated_at" = $2 WHERE "beers"."id" = $3  [["likes", 1], ["updated_at", "2020-08-06 21:51:14.016441"], ["id", 40]]